monsonite/ChipStick/simplex_2_MSP430FR2433_5.c
/*
//---------------------------------------------------------------------
// Initialise the USCI B for Master Mode SPI
//---------------------------------------------------------------------
// recommended procedure: set UCSWRST, configure USCI, configure ports, activate
//---------------------------------------------------------------------
void spi_init(void)
{

//---------------------------------------------------------------------
// Configure the Clock for 16 MHz
  BCSCTL1 = CALBC1_16MHZ;
  DCOCTL =  CALDCO_16MHZ;

//---------------------------------------------------------------------
//  Set  UCSWRST
  UCB0CTL1 = UCSWRST;

//---------------------------------------------------------------------
// Configure USCI B0
  UCB0CTL0 |= UCCKPH + UCMSB + UCMST + UCSYNC;     // 3-pin, 8-bit SPI master
  UCB0CTL1 |= UCSSEL_2;                            // SMCLK
  UCB0BR0 |= 2;                                    // 8 MHz SPI-CLK
  UCB0BR1 = 0;
//UCB0MCTL = 0;

//---------------------------------------------------------------------
// Configure  Ports
  P1SEL |= BIT5 + BIT6 + BIT7;
  P1SEL2 |= BIT5 + BIT6 + BIT7;
  P1DIR |= BIT0 + BIT4 + BIT5 | BIT7;

//---------------------------------------------------------------------
// activate
  UCB0CTL1 &= ~UCSWRST;
}

*/
//--------------------------------------------------------------------------------
// SPI Initialisation for MSP430FR4133 LaunchPad
//--------------------------------------------------------------------------------
//  P5.3 MISO
//  P5.2 MOSI
//  P5.1 SCLK
//  P8.0  /RAM_CS

// '2433 pins

    //  P1.3 MISO
    //  P1.2 MOSI
    //  P1.1 SCLK
    //  P3.0 /RAM_CS


void GPIO_init_2433()
{
  P1DIR = 0xFF; P2DIR = 0xFF; P3DIR = 0xFF;
  P1REN = 0xFF; P2REN = 0xFF; P3REN = 0xFF;
  P1OUT = 0x01; P2OUT = 0x00; P3OUT = 0x01;
}


void spi_init_2433()
{

	// Configure GPIO
	 P3DIR |= BIT0;                          // For /RAM_CS
	 P1SEL0 |= BIT1 | BIT2 | BIT3;           // SCLK, MISO, MOSI pins

	 P3OUT != 1;

	// Configure USCI_B0

	    UCB0CTLW0 |= UCSWRST;                     // **Put state machine in reset**
	    UCB0CTLW0 |= UCMST|UCSYNC|UCCKPH|UCMSB;   // 3-pin, 8-bit SPI master
	                                              // Clock polarity low, MSB
	    UCB0CTLW0 |= UCSSEL_2 ;                   // SMCLK
	    UCB0BR0 = 0x01;                           // /2,fBitClock = fBRCLK/(UCBRx+1).
	    UCB0BR1 = 0;                              //

	    UCB0CTLW0 &= ~UCSWRST;                    // **Initialize USCI state machine**

}


void spi_init_4133()

{
// Configure GPIO
 P3DIR |= BIT0;                          // For /RAM_CS
 P1SEL0 |= BIT1 | BIT2 | BIT3;           // SCLK, MISO, MOSI pins

// Configure USCI_B0

    UCB0CTLW0 |= UCSWRST;                     // **Put state machine in reset**
    UCB0CTLW0 |= UCMST|UCSYNC|UCCKPH|UCMSB;   // 3-pin, 8-bit SPI master
                                              // Clock polarity low, MSB
    UCB0CTLW0 |= UCSSEL_2 ;                   // SMCLK
    UCB0BR0 = 0x01;                           // /2,fBitClock = fBRCLK/(UCBRx+1).
    UCB0BR1 = 0;                              //

    UCB0CTLW0 &= ~UCSWRST;                    // **Initialize USCI state machine**
}



//--------------------------------------------------------------------------------
// 23K256 Serial Ram functions
//--------------------------------------------------------------------------------

char SR_getMode(void) {                                    // Read the Mode of the 23K256
    ssSelect;                                                 // select
    RWData(SR_READ_STATUS); // 0x05
    char mode = RWData(DUMMY_BYTE);
    ssDeselect;                                               // de-select
    return mode;
}

void SR_setMode(char mode) {                               // Write Mode to 23K256
    ssSelect;
    RWData(SR_WRITE_STATUS); // 0x01
    RWData(mode);
    ssDeselect;
}

static inline void SR_writestream(unsigned int addr) {          // Write a stream to 23K256
    ssDeselect; // deselect if we are active
    ssSelect;
    RWData(0x02);                                           // Send command
    RWData(addr >> 8);                                      // Send upper address
    RWData(addr);                                           // Send lower address
}

static inline void SR_readstream(unsigned int addr) {             // Read a stream from 23K256
    ssDeselect;
    ssSelect;
    RWData(0x03);                                            // Send command
    RWData(addr >> 8);                                       // Send upper address
    RWData(addr);                                            // Send lower address
}

//-----------------------------------------------------------------
// SPI Send / Receive

static inline char RWData(char value)
{
    UCB0TXBUF = value;
//    while (!(IFG2 & UCB0TXIFG)) {};        // wait for buffer ready
      while (!(UCB0IFG & UCTXIFG)) {};        // wait for buffer ready
//    while  (!(IFG2 &   UCB0RXIFG));        //  USCI_B0 RX  Received?
    while  (!(UCB0IFG &   UCRXIFG));        //  USCI_B0 RX  Received?
    spi_rx_data    =   UCB0RXBUF;          //  Store received data
    return  spi_rx_data;
}

//------------------------------------------------------------------------------------
// UART Initialisation
// UART provides PC comms on 1.2 and P1.2 - uses USCI A


void uart_init_2433(void)

{

  // Configure UART pins
  P1SEL0 |= BIT4 | BIT5;                    // set 2-UART pin as second function

  // Configure UART
  UCA0CTLW0 |= UCSWRST;
  UCA0CTLW0 |= UCSSEL__SMCLK;

  // Baud Rate calculation
  // 8000000/(16*9600) = 52.083
  // Fractional portion = 0.083
  // User's Guide Table 14-4: UCBRSx = 0x49
  // UCBRFx = int ( (52.083-52)*16) = 1
  UCA0BR0 = 52;                             // 8000000/16/9600
  UCA0BR1 = 0x00;
  UCA0MCTLW = 0x49 | UCOS16 | UCBRF_1;

  UCA0CTLW0 &= ~UCSWRST;                    // Initialize eUSCI
//  UCA0IE |= UCRXIE;                         // Enable USCI_A0 RX interrupt

