monsonite/ChipStick/simplex_2_MSP430FR2433_5.c
//  __bis_SR_register(LPM3_bits|GIE);         // Enter LPM3, interrupts enabled
//  __no_operation();                         // For debugger

}


void uart_init_4133(void)

{

 // Configure UART pins
  P1SEL0 |= BIT0 | BIT1;                    // set 2-UART pin as second function

  // Configure UART
  UCA0CTLW0 |= UCSWRST;
  UCA0CTLW0 |= UCSSEL__SMCLK;

  // Baud Rate calculation
  // 8000000/(16*9600) = 52.083
  // Fractional portion = 0.083
  // User's Guide Table 14-4: UCBRSx = 0x49
  // UCBRFx = int ( (52.083-52)*16) = 1
  UCA0BR0 = 4;                             // 8000000/16/9600
  UCA0BR1 = 0x00;
  UCA0MCTLW = 0x5500 | UCOS16 | UCBRF_1;

  UCA0CTLW0 &= ~UCSWRST;                    // Initialize eUSCI


}

/*

void uart_init(void)
{
	P1SEL  = RXD + TXD;
  	P1SEL2 = RXD + TXD;
  	UCA0CTL1 |= UCSSEL_2;                     // SMCLK
  	UCA0BR0 = 156;                            // 1MHz 9600
  	UCA0BR1 = 0;                              // 1MHz 9600
  	UCA0MCTL = UCBRS0;                        // Modulation UCBRSx = 1
  	UCA0CTL1 &= ~UCSWRST;                     // Initialize USCI state machine
}

*/

//---------------------------------------------------------------------
// UART Primitive Routines uart_putc and uart_get_c

unsigned char uart_getc()
{
//    while (!(IFG2&UCA0RXIFG));                   // USCI_A0 RX buffer ready?

     while (!(UCA0IFG&UCRXIFG));                   // USCI_A0 RX buffer ready?
     return UCA0RXBUF;
}

void uart_putc(unsigned char c)
{
	while (!(UCA0IFG&UCTXIFG));              // USCI_A0 TX buffer ready?
  	UCA0TXBUF = c;                          // TX
}

void uart_puts(const char *str)                 // Output a string
{
     while(*str) uart_putc(*str++);
}

//------------------------------------------------------------------------
// Print a long unsigned int number

  void printlong(unsigned long num)
  {
  if (num / (unsigned long)10 != 0) printlong(num / (unsigned long)10);
  uart_putc((char)(num % (unsigned long)10) + '0');
  return;
  }
//---------------------------------------------------------------------------
// Print a CR-LF

  void crlf(void)                  // send a crlf
  {
    uart_putc(10);
//  uart_putc(13);
  }

  void print_ok()
  {uart_puts((char *)"OK\n\r"); }

 //------------------------------------------------------------------------------------
 // Initialise the ADC on the '4133

void ADC_init_4133(void)
{
}

void ADC_init_2433(void)
{
}


/*
//-------------------------------------------------------------------------------------
// ADC Configuration

  void ConfigureAdc(void)
{
  ADC10CTL1 = INCH_3 + ADC10DIV_3 ;                     // Channel 3, ADC10CLK/3
  ADC10CTL0 = SREF_0 + ADC10SHT_3 + ADC10ON + ADC10IE;  // Vcc & Vss as reference, Sample and hold for 64 Clock cycles, ADC on, ADC interrupt enable
  ADC10AE0 |= BIT3;                                     // ADC input enable P1.3
}

 int ADC_Read(void)
 {
   ADC10CTL0 |= ENC + ADC10SC;			// Sampling and conversion start
   ADC_value = ADC10MEM;
   return ADC_value;
 }
*/
//-------------------------------------------------------------------------------------
// mS delay routine

void delay_mS(int j)
{
    volatile unsigned long i;
           while(j)
  {
           i = 42;             	         // Delay
   	   do (i--);
           while (i != 0);	        // busy waiting (bad)
           j--;
  }
}
//---------------------------------------------------------------------------------

int main(void)
{
	// Initialise '2433

	WDTCTL = WDTPW | WDTHOLD;                // Stop watchdog timer

  // Configure GPIO
  GPIO_init_2433();
  PM5CTL0 &= ~LOCKLPM5;                    // Disable the GPIO power-on default high-impedance mode
                                           // to activate 1previously configured port settings

  __bis_SR_register(SCG0);                 // disable FLL
  CSCTL3 |= SELREF__REFOCLK;               // Set REFO as FLL reference source
  CSCTL0 = 0;                              // clear DCO and MOD registers
  CSCTL1 &= ~(DCORSEL_7);                  // Clear DCO frequency select bits first
  CSCTL1 |= DCORSEL_3;                     // Set DCO = 8MHz
  CSCTL2 = FLLD_0 + 243;                   // DCODIV = 8MHz
  __delay_cycles(3);
  __bic_SR_register(SCG0);                 // enable FLL
  while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1)); // Poll until FLL is locked

  CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK; // set default REFO(~32768Hz) as ACLK source, ACLK = 32768Hz
                                           // default DCODIV as MCLK and SMCLK source


/*
// --------------------------------------------------------------------------------------------------------------------
	// Initialise '4133

        WDTCTL  = WDTPW + WDTHOLD; 	             // Stop WDT

        PM5CTL0 &= ~LOCKLPM5;                       // Disable the GPIO power-on default high-impedance mode

//        Serial.begin(100000);                        // initialises timing functions

//	BCSCTL1 = CALBC1_1MHZ;                       // Set DCO
//  	DCOCTL  = CALDCO_1MHZ;
	P1DIR  = BIT0 + BIT6; 		              // P1.0 and P1.6 are the red+green LEDs
	P1OUT  = BIT0 + BIT6; 		              // All LEDs off

	*/

// --------------------------------------------------------------------------------------------------------------------
        // uart_init_4133();                                  // Initialise the '4133 UART for 96000 baud
		 uart_init_2433();

       // spi_init_4133();                                   // Initialise the '4133 SPI on USCIB  8MHz clock, master mode
	    spi_init_2433();

        uart_puts((char *)"MSP430 SIMPLEX\n\r");      // send opening banner message

        spi_check();                                  // Make sure SPI RAM is connected and in the correct streaming mode

        P1DIR  = BIT0; 		              // P1.0 is the green LED
        P1OUT  = BIT0; 		              // All LEDs off

        P3DIR  = BIT0; 		              // P1.0 is the RED LED
        P3OUT  |= BIT0; 		              // RED LEDs on

 //       P1SEL |= BIT3;	                              // ADC input pin P1.3
        //ADC_init_4133();

		ADC_init_2433();

        WDTCTL = WDTPW + WDTTMSEL + WDTIS1;            // enable watchdog - interval mode
        parray = &array[0][0];                        // parray is the pointer to the first element of code buffer
        px_array = &block_array[0];                   // px_array is pointer to first element of RAM transfered block array
//       delay(1);
//        time = micros();
//        printlong(time);                 // used for timing functions

        print_ok();
        crlf();

//        LCD_print_4133();

//-------------------------------------------------------------------------------
// Interpreter Loop
  while(1)
  {

