monsonite/ChipStick/simplex_2_MSP430FR2433_5.c
  textRead(buf, 64);                                  // This is the endless while loop which implements the SIMPL interpreter - just 3 simple functions
  textChk(buf);                                       // check if it is a : character for beginning a colon definition
  textEval(buf);

  }   // end of interpreter loop

}    // End of main

//-------------------------------------------------------------------------------
// Language Functions  - Words
// ------------------------------------------------------------------------------

//  Read the character into the buffer

void textRead (char *p, char n) {
  char i = 0;
  while (i < (n-1)) {
    char ch = uart_getc();
    if (ch == '\r' || ch == '\n') break;
    if (ch >= ' ' && ch <= '~') {
      *p++ = ch;
      i++;
    }
  }
  *p = 0;
}

// ---------------------------------------------------------------------------------------------------------
void textChk (char *buf)       // Check if the text starts with a colon and if so store in user's word RAM array  parray[]
{
  if (*buf == ':')  {
  char ch;
  int i =0;
  while ((ch = *buf++)){

  if (ch == ':') {
  uart_putc(*buf);   // get the name from the first character
  uart_putc(10);
  uart_putc(13);
  name = *buf ;
  buf++;
  }

  bufWrite((parray + (len*(name-65) +i)),*buf);

  i++;

}

 x = 1;

}
}

// ---------------------------------------------------------------------------------------------------------

void textEval (char *buf) {

  char *loop;
  char *start;
  char ch;

  unsigned long k = 0;

  while ((ch = *buf++)) {                         // Is it a number?
    switch (ch) {
    case '0':
    case '1':
    case '2':
    case '3':
    case '4':
    case '5':
    case '6':
    case '7':
    case '8':
    case '9':
      x = ch - '0';
      while (*buf >= '0' && *buf <= '9') {
        x = x*10 + (*buf++ - '0');                // If  a number store it in "x"
      }
      break;

//-------------------------------------------------------------------------------
 // User Words
      case 'A':                // Point the interpreter to the array containing the words
      case 'B':
      case 'C':
      case 'D':
      case 'E':
      case 'F':
      case 'G':
      case 'H':
      case 'I':
      case 'J':
      case 'K':
      case 'L':
      case 'M':
      case 'N':
      case 'O':
      case 'P':
      case 'Q':
      case 'R':
      case 'S':
      case 'T':
      case 'U':
      case 'V':
      case 'W':
      case 'X':
      case 'Y':
      case 'Z':

      textEval(parray + (len*(ch-65)));            // Evaluate and execute the User's expression fo RAM

      break;

//---------------------------------------------------------------------------------
//  (a - h  hijacked for SPI RAM extensions - SIMPLEX!)

      case 'a':         // Address  (for writing to RAM)
      address =(x);
      break;

      case 'b':         // Block   - fetch a block from external memory
      get_block(x);
      break;

      case 'c':         // Compile
      hex_print_2(x);
      break;

      case 'd':         // HEX Dump  -  dump x bytes starting at address y
      hex_dump(y,x);
      print_ok();
      break;

/*
      case 'd':         // Decimal Dump
      dump(y,x);        // dump y bytes starting at address x
      break;
*/
      case 'e':         // Execute
      execute_block(x);
      break;

      case 'f':         // File  // fill y bytes starting at address x with test data
      spi_fill(y,x);
      print_ok();
      break;

      case 'g':         // Go
      run_block();
      break;

      case 'n':         // Go
//      LCD_display_n(x);
      break;

//--------------------------------------------------------------------------------
// Primitive and User vocabulary defined in this section
// Timing & Printing Group

      case 'p':
      printlong(x);                        // print long integer
      break;

      case 'q':                            // print integer with crlf
      printlong(x);
      crlf();
      break;

      case 't':
//      time = micros();
      printlong(time/16);                 // used for timing functions
      crlf();
      break;

      case 'v':
//      time = micros();
      printlong(time/16);                 // used for timing functions
      crlf();
      break;

/*
      case 'd':
      d = x;
      break;
*/

      case '_':                              // Print the string enclosed between underscores  eg.  _Hello_
      while ((ch = *buf++) && ch != '_') {
      uart_putc(ch);
      }
      uart_putc(10);
      break;

      case 92 :                              //  ASCII 92 forward slash \ Copy the text enclosed between \ and \ to RAM
      while ((ch = *buf++) && ch != 92) {
      uart_putc(ch);
      }
      uart_putc(10);
      put_block(address);

      break;

//----------------------------------------------------------
// Arithmetic Group

      case '+':
      x = x+y;
      break;

      case '-':
      x = x-y;
      break;

      case '*':
      x = x*y;
      break;

      case '/':
      x = x/y;
      break;

      case '%':
      x = x%y;
      break;

      case 'x':
      x = x + 1;
      break;

      case 'y':
      y = y + 1;
      break;

//--------------------------------------------------------------------
// Logical Group - provides bitwise logical function between x and y

      case '&':
      x = x&y;                             // Logical AND
      break;

      case '|':
      x = x|y;                             // Logical OR
      break;

      case '^':
      x = x^y;                             // Logical XOR
      break;

      case '~':
      x = !x;                              // Complement x
      break;

      case ' ':                            // Transfer x into second variable y
      k=y;                                 // Transfer loop counter into k
      y= x;
      break;

      case '#':                            // Load x with the ASCII value of the next character  i.e. 5 = 35H or 53 decimal
      x=*(buf-2);
      break;

      case '$':                            // print out a number as either a 2 digit or 4 digit Hexadecimal
      if(x<=255) {hex_print_2(x); break;}
      hex_print_4(x);
      break;

// ----------------------------------------------------------------------
// Memory Group

      case '!':     // store
      y = x;
      break;

      case '@':     // Fetch
      x = y;
      break;

