monsonite/ChipStick/simplex_2_MSP430FR2433_5.c
/*
      case 'r':                         // read a byte from RAM
      bite = bufRead(x);                // x = address
      x = bite;
      uart_putc(x);                     // print the character
      break;

      case 'q':                         // read a block of x bytes of RAM at address y
      for (int i=0; i<x; i++) {
      bite = bufRead(y+i);              // read the array
      uart_putc(bite);                  // print the character to the serial port
      }
      break;


      case 'w':                         // write a byte to RAM  address in y, data in x
      bufWrite(y,x);
      break;

*/

//--------------------------------------------------------------------
// Comparison Test and conditional Group

      case '<':
      if(x<y){x=1;}              // If x<y x= 1 - can be combined with jump j
      else x=0;
      break;

      case '>':
      if(x>y){x=1;}              // If x>y x= 1 - can be combined with jump j
      else x=0;
      break;

      case 'j':                  // test  if x = 1 and jump next instruction
      if(x==1){*buf++;}
      break;

//----------------------------------------------------------------------------------
// Print out the current word list

      case '?':                             // Print out all the RAM
      parray = &array[0][0];                // reset parray to the pointer to the first element

      for ( j = 0; j<26; j++) {

      uart_putc(j+65);                  // print the caps word name
      uart_putc(32);                    // space

      for ( l=0; l<len; l++) {
      in_byte = bufRead( parray +  (j *len )+l);          // read the array
      uart_putc(in_byte);                                 // print the character to the serial port
    }

     crlf();

   }
   for( l = 0; l <11; l++)      // add some spaces to make it more legible on the page

   {
   crlf();
   }
    break;
//----------------------------------------------------------------------------------------------------
// Conditional Code branch

    case '[':                                     // The start of a condition test
      k = x;
      start = buf;                               // remember the start position of the test
      while ((ch = *buf++) && ch != ']') {       // get the next character into ch and increment the buffer pointer *buf - evaluate the code
      }

     case ']':
    if (x) {                                    // if x is positive - go around again
     buf = start;
    }
      break;

//--------------------------------------------------------------------------
// Case Statement Selection
// Select some code from a list separated by commas

//5(0p,1p,2p,3p,4p,5p,6p)  should select 5 and print it

case '(':

      k = x;                                                 // copy x to use as the "phrase counter"
                                                             // decrement k to see whether to interpret or not
      while (k)
      {
      ch = *buf++;
      if (ch == ',')
      { k--;}
      }
      break;

      case ',':

      k--;                                              //
      while (k<0)                                       // k < 0 so skip the remaining entries in the list
      {
      ch = *buf++;                                      // skip the remaining characters
      if (ch == ')') {break;}
      }

      break;
//-----------------------------------------------------------------------------------------------------------------------------------------------
// Analogue and Digital Input and Output Group   - these add heavily to total - need to be converted to MSP430

      case 's':
//      x = ADC_Read();         // Adds 38 bytes
      break;

 /*
      case 'a':
      analogWrite(d,x);           // adds 340 bytes
      break;



      case 'i':
      x = digitalRead(d);        // adds 100 bytes
      break;

      case 'o':
      digitalWrite(d, x%2);     // adds 18 bytes
      break;
 */

//-------------------------------------------------------------------
// Delays Group

    case 'm':
//    delay(x<<4);
    break;

    case 'u':
//    delayMicroseconds(x<<4);
    break;
//---------------------------------------------------------------------

    case '{':
      k = x;
      loop = buf;
      while ((ch = *buf++) && ch != '}') {
      }
    case '}':
      if (k) {
        k--;
        buf = loop;
      }
      break;


    case 'k':
      x = k;
      break;

// -----------------------------------------------------------------------------
// Launchpad LED group  support for red and green LEDs on entry level LaunchPad

      case 'w':
 {
 P1OUT |= BIT0;
 }
 break;

 case 'r':
 {
 P1OUT &= ~BIT0;
 }
 break;

 case 'h':
 {
 P3OUT |= BIT0;
 }
 break;

 case 'l':
 {
 P3OUT &= ~BIT0;
 }
 break;

// ----------------------------------------------------------------------

    }
  }
}

//-----------------------------------------------------------------------------
// SPI RAM Extensions to SIMPL   Test routines etc
//---------------------------------------------------------------------

char RAM_stream_mode()
{

    ssDeselect;
    delay_1ms;

        char chipMode;

        chipMode = SR_getMode();    // check status register for sequential mode
        if (chipMode != 0x41) {
            SR_setMode(0x41);
             return 0;
        }
        return 1;
       }
//---------------------------------------------------------------------------
// Check that the external RAM is present and that it is in Sequential Mode
int spi_check()

{
        ssDeselect;
        delay_1ms;
        char chipMode;

        // make sure there is a 23K256 chip and that
        // is wired properly and in sequential mode

        chipMode = SR_getMode();
        if (chipMode != 0x41)
        {
            SR_setMode(0x41);
            uart_puts((char *)"SPI RAM not found\n\r");
        }
        else
        {
        uart_puts((char *)"32K SPI RAM Connected!\n\r");
        }
}

